{"format": "layers-model", "generatedBy": "keras v2.2.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.2.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_layer", "input_length": 250, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "embeddings_constraint": null, "output_dim": 50, "dtype": "float32", "embeddings_regularizer": null, "batch_input_shape": [null, 250], "input_dim": 5, "trainable": true}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "unit_forget_bias": true, "use_bias": true, "return_sequences": true, "recurrent_dropout": 0.0, "return_state": false, "bias_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "units": 62, "unroll": false, "activation": "tanh", "implementation": 1, "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_constraint": null}}, "name": "bidirectional_1", "trainable": true, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.2, "trainable": true}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "unit_forget_bias": true, "use_bias": true, "return_sequences": false, "recurrent_dropout": 0.0, "return_state": false, "bias_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "units": 62, "unroll": false, "activation": "tanh", "implementation": 1, "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_constraint": null}}, "name": "bidirectional_2", "trainable": true, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 32, "activation": "softmax", "use_bias": true, "bias_constraint": null, "trainable": true}}]}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "lr": 0.0010000000474974513, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "amsgrad": false, "beta_2": 0.9990000128746033}}, "loss": "sparse_categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null, "metrics": ["accuracy"]}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [50, 248], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [62, 248], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/bias", "shape": [248], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [50, 248], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [62, 248], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/bias", "shape": [248], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/kernel", "shape": [124, 248], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "shape": [62, 248], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/bias", "shape": [248], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/kernel", "shape": [124, 248], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "shape": [62, 248], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/bias", "shape": [248], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [124, 32], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [32], "dtype": "float32"}, {"name": "embedding_layer/embeddings", "shape": [5, 50], "dtype": "float32"}]}]}